app/components/BasicController.php

SELECT * FROM `config`
---
    public function init() {

      $items = Config::find()->all();