controllers/LoadController.php

SELECT * FROM `trailer_load` WHERE (((`shipping_date` >= 1431032400) AND (`shipping_date` < 1431810000)) OR ( (`completed` = 0 AND `shipping_date` < 1431032400) )) AND (`completed`=0) ORDER BY `shipping_date`
---
    public function actionGet() {
      $showCompleted = Yii::$app->request->get('showCompleted');

      $query = TrailerLoad::find()->orderBy('shipping_date asc')->where(['>=', 'shipping_date', mktime(0, 0, 0)])->andWhere(['<', 'shipping_date', mktime(0, 0, 0) + 9 * 24 * 60 * 60]);

      $query->orWhere( ' (`completed` = 0 AND `shipping_date` < ' . mktime( 0, 0, 0 ) . ') ' );

      if (!$showCompleted)
        $query->andWhere(['completed' => 0]);

      $items = $query->all();

INSERT INTO `trailer_load` (`shipping_date`, `completed`, `processed`, `dealer`, `number_of_spas`, `number_of_swimspas`, `shipper`, `trailer_type`, `status`, `thinkness`, `weight`) VALUES ('1431205200', 0, 0, 'ghjfg', NULL, NULL, '', '', '1', NULL, 'bold')
---
    function actionCreate() {
      $model = new TrailerLoad();

      if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `trailer_load` WHERE `trailer_load_id`='18'
---
    function findModel($id) {
      if (($model = TrailerLoad::findOne($id)) !== NULL) {