controllers/SiteController.php

SELECT * FROM `trailer_load` WHERE (((`shipping_date` >= 1431032400) AND (`shipping_date` < 1431810000)) OR ( (`completed` = 0 AND `shipping_date` < 1431032400) )) AND (`completed`=0) ORDER BY `shipping_date`
---
    public function actionIndex($showCompleted = 0) {
      $query = TrailerLoad::find()->orderBy( 'shipping_date asc' )->where( [ '>=', 'shipping_date', mktime( 0, 0, 0 ) ] )->andWhere( [ '<', 'shipping_date', mktime( 0, 0, 0 ) + 9 * 24 * 60 * 60 ] );

      $query->orWhere( ' (`completed` = 0 AND `shipping_date` < ' . mktime( 0, 0, 0 ) . ') ' );

      if ( Yii::$app->user->isGuest )
        $showCompleted = 0;

      if ( !$showCompleted )
        $query->andWhere( [ 'completed' => 0 ] );

      $items = $query->all();

SELECT * FROM `trailer_load` WHERE (`shipping_date` >= 1428958800) AND (`shipping_date` < 1429736400) ORDER BY `shipping_date`
SELECT * FROM `trailer_load` WHERE (`shipping_date` >= 1428872400) AND (`shipping_date` < 1429045200) ORDER BY `shipping_date`
---
    public function actionHistory() {
      $model = new SearchModel();
      $model->from = time() - 60 * 60 * 24;
      $model->to = time();

      if ( $model->load( Yii::$app->request->post() ) && $model->doo() ) ;

      $query = TrailerLoad::find()->orderBy( 'shipping_date asc' );

      $query->where( [ '>=', 'shipping_date', $model->from ] )->andWhere( [ '<', 'shipping_date', $model->to ] );