views/common/table.php

              $names_spas = $item->getHotTubsToTrailerLoads();
              if ($names_spas) foreach ($names_spas as $name_spas) {
                $list_one[$name_spas->getHotTubModel()->one()->hot_tub_model_id]['name'] = $name_spas->getHotTubModel()->one()->hot_tub_model_name;
                $list_one[$name_spas->getHotTubModel()->one()->hot_tub_model_id]['count']++;
---
SELECT * FROM `hot_tub_models` WHERE `hot_tub_model_id`='2'

              $names_swim_spas = $item->getSwimSpasToTrailerLoads();
              if ($names_swim_spas) foreach ($names_swim_spas as $name_swim_spas) {
                $list_two[$name_swim_spas->getSwimSpaModel()->one()->swim_spa_model_id]['name'] = $name_swim_spas->getSwimSpaModel()->one()->swim_spa_model_name;
                $list_two[$name_swim_spas->getSwimSpaModel()->one()->swim_spa_model_id]['count']++;
---
SELECT * FROM `swim_spa_models` WHERE `swim_spa_model_id`='7'