app/controllers/LoadController.php

SELECT * FROM `trailer_load` WHERE (`shipping_date` >= 1422144000) AND (`shipping_date` < 1422748800) ORDER BY `shipping_date`
SELECT * FROM `trailer_load` WHERE ((`shipping_date` >= 1421971200) AND (`shipping_date` < 1422576000)) AND (`completed`=0) ORDER BY `shipping_date`
---
    public function actionGet() {
      $showCompleted = Yii::$app->request->get('showCompleted');

      $query = TrailerLoad::find()->orderBy('shipping_date asc')->where(['>=', 'shipping_date', mktime(0, 0, 0)])->andWhere(['<', 'shipping_date', mktime(0, 0, 0) + 7 * 24 * 60 * 60]);

      if (!$showCompleted)
        $query->andWhere(['completed' => 0]);

      $items = $query->all();