app/controllers/SiteController.php

SELECT * FROM `trailer_load` WHERE ((`shipping_date` >= 1422144000) AND (`shipping_date` < 1422748800)) AND (`completed`=0) ORDER BY `shipping_date`
---
    public function actionIndex($showCompleted = 0) {
      $query = TrailerLoad::find()->orderBy('shipping_date asc')->where(['>=', 'shipping_date', mktime(0, 0, 0)])->andWhere(['<', 'shipping_date', mktime(0, 0, 0) + 7 * 24 * 60 * 60]);

      if (Yii::$app->user->isGuest)
        $showCompleted = 0;

      if (!$showCompleted)
        $query->andWhere(['completed' => 0]);

      $items = $query->all();