app/models/Users.php

    public static function findIdentity($id) {
      return static::findOne($id);
---
SELECT * FROM `users` WHERE `id`='1'