app/views/load/_form.php

SELECT * FROM `hot_tub_models` ORDER BY `hot_tub_model_name`
SELECT * FROM `swim_spa_models` ORDER BY `swim_spa_model_name`
---
    $items_for_spas = yii\helpers\ArrayHelper::map($spas_models, 'hot_tub_model_id', 'hot_tub_model_name');

    $swim_spas_models = app\models\SwimSpaModels::find()->all();
=======
    $spas_models = app\models\HotTubModels::find()->orderBy('hot_tub_model_name asc')->all();
    $items_for_spas = yii\helpers\ArrayHelper::map($spas_models, 'hot_tub_model_id', 'hot_tub_model_name');

    $swim_spas_models = app\models\SwimSpaModels::find()->orderBy('swim_spa_model_name asc')->all();