models/TrailerLoad.php

SELECT * FROM `hot_tubs_to_trailer_loads` WHERE `trailer_load_id`='20'
SELECT * FROM `swim_spas_to_trailer_loads` WHERE `trailer_load_id`='20'
---
    public function afterSave() {
      if (!$this->isNewRecord) {
        $ht = HotTubsToTrailerLoads::find()->where(['trailer_load_id' => $this->trailer_load_id])->all();
        if ($ht) foreach ($ht as $oht) $oht->delete();

        $ss = SwimSpasToTrailerLoads::find()->where(['trailer_load_id' => $this->trailer_load_id])->all();

SELECT * FROM `hot_tubs_to_trailer_loads` WHERE `trailer_load_id`='18'
---
    public function getHotTubsToTrailerLoads() {
      return $this->hasMany(HotTubsToTrailerLoads::className(), ['trailer_load_id' => 'trailer_load_id'])->all();

SELECT * FROM `swim_spas_to_trailer_loads` WHERE `trailer_load_id`='18'
---
    public function getSwimSpasToTrailerLoads() {
      return $this->hasMany(SwimSpasToTrailerLoads::className(), ['trailer_load_id' => 'trailer_load_id'])->all();